{
  "samsung-com-redesign": {
    "name": "Samsung.com Redesign",
    "slug": "samsung-com-redesign",
    "role": ["UX Research", "Experience Design"],
    "agency": "R/GA",
    "intro":
      "Samsung needed help turning a brittle site into smart and flexible system. Our design needed to support individual shoppers across a huge range of products — from stoves to smartphones. I helped lead a team of UX researchers and designers on a cross-country research tour. We used in-home interviews, usability tests, and retail shop-alongs to understand how people research, shop and buy products across the Samsung range.\n\nWe then designed a series of reusable content blocks informed by the user pain points and needs. Since it was hard to find non-smartphone products — making other shoppers feel like “second class citizens — we created a new flattened global navigation. Since products in the same range were impossible to tell apart, we made a new product grid focused on key differences. And we eliminated a whole section of the site, moving content showing the product in action from marketing landing pages into the main purchase flow.\n\nOur initial launch resulted in a 40% increase in conversion. When a later shift in strategy made our initial building blocks too restrictive, we deconstructed them into a design system and living styleguide. This lets teams at R/GA and Samsung continue to create much richer pages out of a common set of building blocks. ",
    "images": [
      {
        "alt": "Dotcom User Journey",
        "caption":
          "I documented the user journey for each of the major shopper types coming to the site.",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/5BzzAHK7WEAwI6Gw6qAcYC/5559b3fd4f9e08b7dc326cedd5f57880/dotcom-user-journey.jpg"
      },
      {
        "alt": "Dotcom Global Navigation",
        "caption": "The new global navigation with flattened hierarchy.",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/1ULdHkAPnKoEkqgiECUQg2/abf6454ecf4bf8729dff48fb7eaa04c1/dotcom-global-nav.jpg"
      },
      {
        "alt": "Page Header for Tab S3",
        "caption":
          "Each product's differentiating specs are front and center, with an option to dive deep.",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/EqsrnbnUSOGSeWysgWC6k/b3c146794879bd16dc3b58f150a6a939/dotcom-tab-page.jpg"
      },
      {
        "alt": "Dotcom Product Finder Page",
        "caption":
          "The product finder shows users the most different features, not just ones featured in marketing.",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/5Zic5xpYWIsiWmE40qciSk/e25ad8fd00db3eaa1ea10f2e06eab271/dotcom-product-finder.jpg"
      },
      {
        "alt": "Styleguide Intro Animation",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/fbYGYGhDfG8sEcCoq0068/beb4dd5778ee120ec0673ae3b6fe1d22/styleguide-intro.gif"
      },
      {
        "alt": "Styleguide Buttons Section",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/5yRo4ShSjCCmAwo2GGGOWo/79ab55656969c9068b3a72d5669cb64f/styleguide-buttons.jpg"
      },
      {
        "alt": "Styleguide Grid Module",
        "caption":
          "The styleguide site featured an interactive grid component to see how elements adapt to different breakpoints.",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/2z3Jz9qQDWUCmKEaw0SGY0/90d0e2fac0deb44857a5161d3842277d/styleguide-grid.jpg"
      },
      {
        "alt": "Styleguide Page Types Section",
        "caption":
          "A section of the styleguide for marketing project leads to make sure they choose the right page for the job.",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/7yMoJdVBGo4K4KSI4kqOaQ/c9f5c8d15f0d0ef432eac35db59799c5/styleguide-page-types.jpg"
      }
    ]
  },
  "samsung-retail": {
    "name": "Samsung Retail",
    "slug": "samsung-retail",
    "role": ["Design"],
    "agency": "R/GA",
    "intro":
      "Samsung maintains a TV demo area in large retail stores across the country. Over the years, more content and controls appeared without a plan. The experience became bloated and fragile. The goal of this project was to design a simpler interaction model — giving users control without getting in their way. The system also needed to be easier for Samsung to track and maintain.\n\nThe design solution revolves around a touchscreen where users can choose the specific content and TVs that interest them. Competitor experiences tend to only have a preset content loop and stuffy touchscreen brochures. The surrounding stations highlight a fluctuating set of features and accessories. These use simple buttons covered by a printed \"interface\" so store employees can change them on-demand. This approach was inspired by paper prototypes I made in collaboration with our hardware engineers.\n\nThe whole system runs on a network built in-house by R/GA. I designed a monitoring and content management dashboard on top of this infrastructure. For the first time, Samsung has real-time visibility into the status of the system. Technicians get alerts exactly when and where errors occur. And Samsung is able to update content without incurring high costs and lead time.\n\nThe Samsung Entertainment Experience is now runs at 98% average uptime and consumer understanding of TV features has doubled year over year.",
    "images": [
      {
        "alt": "SEE Paper Prototype",
        "caption":
          "The rapid prototyping method that inspired the production solution. There are button panels under there.",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/3DZZfDBxk4880SAYOUY6MY/b2cf6d3d05a7c7459f9fe9de705aa421/see-paper-prototype.jpg"
      },
      {
        "alt": "SEE Touchscreen Home",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/33M04XcypWUGqIYeUgyqKc/73f9e3fb07278b0e24642071014cee91/see-touchscreen-home.jpg"
      },
      {
        "alt": "SEE Touchscreen Story",
        "caption": "Users can choose the content they're interested in.",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/6y5iQo28Rq02wSMUWeEs4G/e78ec5c1a6aa591c1b93556eefeae867/see-touchscreen-story.jpg"
      },
      {
        "alt": "dashboard homepage",
        "caption": "this is a super cool caption about this particular image",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/6CNtfOn0ekWEOOmsWq0SMK/8fe7a74fe6c847a8ee66a0273024774f/home.jpg"
      },
      {
        "alt": "dashboard store page",
        "caption": "another completely rad caption about an image",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/798KinJKa4Cwsgmm8Q0Aga/76ab7b35a2846e8a89c016ab9e5f0334/stores.jpg"
      },
      {
        "alt": "dashboard analytics page",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/7GiMTDU880eIOecgEQC0gc/cb5b6db0e8a068f9d627999915bcc680/analytics.jpg"
      },
      {
        "alt": "dashboard content management",
        "caption": "our custom content management and deployment solution",
        "url":
          "https://images.ctfassets.net/lvkl8m0j593s/2R0mnF70BO2cEey6qMc2yg/498bb871cce68cd2004f11dfc10f74a9/content.jpg"
      }
    ]
  }
}
