{"samsung-retail":{"name":"Samsung Retail","slug":"samsung-retail","role":["Interaction design","Hardware prototyping"],"results":["98% average uptime for the year","200% increase in consumer understanding of TV features."],"link":"https://www.bestbuy.com/site/store-locator","intro":"Samsung maintains a TV demo area in large electronics retailers – like Best Buy and Costco — across the country. Before we got involved, content and controls were added to the experience every year on an ad hoc basis. Without a standardized model for the user’s experience, the system hard for customers to understand and for Samsung to keep from breaking. Our goal was to design a simpler, more intuitive interaction model AND create an architecture that Samsung could replicate and maintain at over 1,000 locations.\n\nThe new “Samsung Entertainment Experience” is anchored by a touchscreen where users can accomplish their main mission at the store: to see how the picture looks in a side-by-side comparison. As opposed to the competing experiences in the store — where customers are faced with a choice between a pre-set content loop or a stuffy brochure on a screen — our model lets them choose exactly what content they want to see and which TVs to see it on.  \n\nBesides the TV comparison wall, other stations in the experience that highlight a constantly fluctuating set of features and accessories — everything from soundbars to shelf brackets. We needed a solution that didn’t distract from the main event and could be changed very frequently. Inspired by approach the paper prototypes I made alongside our hardware engineers, we designed a button panel that could be covered with a printed vinyl “interface”. Not only does this keep things subtle, store employees can respond to changes overnight by simply printing a new, inexpensive graphic.\n\nTo achieve these interactions and keep the experience in sync across 1,000+ stores, the whole system runs on a custom network built in-house by R/GA. Because of this architecture I was able to design a companion monitoring and content management web app. For the first time, Samsung has real-time visibility into the status of the system. Technicians get alerts exactly when and where errors occur. And Samsung is able to update content without incurring high costs and lead time.\n\nSee below for some shots of the experience and key screens from the dashboard web app.","images":[{"alt":"SEE Paper Prototype","caption":"The rapid prototyping method that inspired the production solution. There are button panels under there.","url":"https://images.ctfassets.net/lvkl8m0j593s/3DZZfDBxk4880SAYOUY6MY/b2cf6d3d05a7c7459f9fe9de705aa421/see-paper-prototype.jpg"},{"alt":"SEE Touchscreen Home","url":"https://images.ctfassets.net/lvkl8m0j593s/33M04XcypWUGqIYeUgyqKc/73f9e3fb07278b0e24642071014cee91/see-touchscreen-home.jpg"},{"alt":"SEE Touchscreen Story","caption":"Users can choose the content they're interested in.","url":"https://images.ctfassets.net/lvkl8m0j593s/6y5iQo28Rq02wSMUWeEs4G/e78ec5c1a6aa591c1b93556eefeae867/see-touchscreen-story.jpg"},{"alt":"dashboard homepage","caption":"this is a super cool caption about this particular image","url":"https://images.ctfassets.net/lvkl8m0j593s/6CNtfOn0ekWEOOmsWq0SMK/8fe7a74fe6c847a8ee66a0273024774f/home.jpg"},{"alt":"dashboard store page","caption":"another completely rad caption about an image","url":"https://images.ctfassets.net/lvkl8m0j593s/798KinJKa4Cwsgmm8Q0Aga/76ab7b35a2846e8a89c016ab9e5f0334/stores.jpg"},{"alt":"dashboard analytics page","url":"https://images.ctfassets.net/lvkl8m0j593s/7GiMTDU880eIOecgEQC0gc/cb5b6db0e8a068f9d627999915bcc680/analytics.jpg"},{"alt":"dashboard content management","caption":"our custom content management and deployment solution","url":"https://images.ctfassets.net/lvkl8m0j593s/2R0mnF70BO2cEey6qMc2yg/498bb871cce68cd2004f11dfc10f74a9/content.jpg"}]},"samsung-dotcom":{"name":"Samsung​.com Redesign","slug":"samsung-dotcom","role":["UX Research","Experience Design"],"results":["40% lift in conversion rate","Client’s first digital design system documentation"],"link":"http://samsung.com","intro":"Samsung needed help turning a brittle site into smart and flexible system. Our design had to support individual shoppers across a huge range of products — from stoves to smartphones. To figure out how, I helped lead a team of UX researchers and designers on a cross-country research tour. We used in-home interviews, usability tests, and retail shop-alongs to understand how people research, shop and buy products across the Samsung range.\n\nBack at R/GA, we emerged from our mountain of post-it notes with a system of reusable content blocks informed by the users pain points and needs. Since it was hard to find non-smartphone products — making other shoppers feel like “second class citizens” — we created a new flattened global navigation. Since products in the same range were impossible to tell apart, we designed a new product grid focused on key differences. And we eliminated a whole section of the site, moving content showing the product in action from marketing landing pages into the main purchase flow.\n\nOur initial launch resulted in an immediate 40% increase in conversion — it turns out the customer was right. And when a later shift in strategy made our initial building blocks too restrictive, a small team and I deconstructed them into a design system and living styleguide. This tool lets teams at both R/GA and Samsung continue to create much richer pages out of a common set of building blocks. \n\nCheck out below for images of the site and styleguide with handy notes.","images":[{"alt":"Dotcom User Journey","caption":"I documented the user journey for each of the major shopper types coming to the site.","url":"https://images.ctfassets.net/lvkl8m0j593s/5BzzAHK7WEAwI6Gw6qAcYC/5559b3fd4f9e08b7dc326cedd5f57880/dotcom-user-journey.jpg"},{"alt":"Dotcom Global Navigation","caption":"The new global navigation with flattened hierarchy.","url":"https://images.ctfassets.net/lvkl8m0j593s/1ULdHkAPnKoEkqgiECUQg2/abf6454ecf4bf8729dff48fb7eaa04c1/dotcom-global-nav.jpg"},{"alt":"Page Header for Tab S3","caption":"Each product's differentiating specs are front and center, with an option to dive deep.","url":"https://images.ctfassets.net/lvkl8m0j593s/EqsrnbnUSOGSeWysgWC6k/b3c146794879bd16dc3b58f150a6a939/dotcom-tab-page.jpg"},{"alt":"Dotcom Product Finder Page","caption":"The product finder shows users the most different features, not just ones featured in marketing.","url":"https://images.ctfassets.net/lvkl8m0j593s/5Zic5xpYWIsiWmE40qciSk/e25ad8fd00db3eaa1ea10f2e06eab271/dotcom-product-finder.jpg"},{"alt":"Styleguide Intro Animation","url":"https://images.ctfassets.net/lvkl8m0j593s/fbYGYGhDfG8sEcCoq0068/beb4dd5778ee120ec0673ae3b6fe1d22/styleguide-intro.gif"},{"alt":"Styleguide Buttons Section","url":"https://images.ctfassets.net/lvkl8m0j593s/5yRo4ShSjCCmAwo2GGGOWo/79ab55656969c9068b3a72d5669cb64f/styleguide-buttons.jpg"},{"alt":"Styleguide Grid Module","caption":"The styleguide site featured an interactive grid component to see how elements adapt to different breakpoints.","url":"https://images.ctfassets.net/lvkl8m0j593s/2z3Jz9qQDWUCmKEaw0SGY0/90d0e2fac0deb44857a5161d3842277d/styleguide-grid.jpg"},{"alt":"Styleguide Page Types Section","caption":"A section of the styleguide for marketing project leads to make sure they choose the right page for the job.","url":"https://images.ctfassets.net/lvkl8m0j593s/7yMoJdVBGo4K4KSI4kqOaQ/c9f5c8d15f0d0ef432eac35db59799c5/styleguide-page-types.jpg"}]}}